In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('student.csv',index_col= "Unnamed: 0")

In [3]:
df

  name  age
0    a   36
1    b   22
2    c   26
3    d   24
4    e   25
5    f   26
6    g   50
7    h   55
8    i   60

## Core- Operation DataFrame

In [4]:
df.head()   ## provide first 5 rows

  name  age
0    a   36
1    b   22
2    c   26
3    d   24
4    e   25

In [5]:
df.head(7)

  name  age
0    a   36
1    b   22
2    c   26
3    d   24
4    e   25
5    f   26
6    g   50

In [6]:
df.tail(3)

  name  age
6    g   50
7    h   55
8    i   60

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    9 non-null      object
 1   age     9 non-null      int64
dtypes: int64(1), object(1)
memory usage: 216.0+ bytes

In [8]:
df.select_dtypes('object')

  name
0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i

In [9]:
df.select_dtypes('int64')

   age
0   36
1   22
2   26
3   24
4   25
5   26
6   50
7   55
8   60

In [10]:
df['age']    ## 1 ta [] provide series

0    36
1    22
2    26
3    24
4    25
5    26
6    50
7    55
8    60
Name: age, dtype: int64

In [11]:
df[['age']]  ## 2 ta [[]] provide dataframe

   age
0   36
1   22
2   26
3   24
4   25
5   26
6   50
7   55
8   60

In [12]:
df[['name','age']]

  name  age
0    a   36
1    b   22
2    c   26
3    d   24
4    e   25
5    f   26
6    g   50
7    h   55
8    i   60

In [13]:
df1 = df.copy()    ## main dataframe er kono change hobe na

In [14]:
df.drop([5,6])

  name  age
0    a   36
1    b   22
2    c   26
3    d   24
4    e   25
7    h   55
8    i   60

In [15]:
df

  name  age
0    a   36
1    b   22
2    c   26
3    d   24
4    e   25
5    f   26
6    g   50
7    h   55
8    i   60

In [16]:
df.drop([5,6],inplace = True) ## main dataframe change hobe

In [17]:
df

  name  age
0    a   36
1    b   22
2    c   26
3    d   24
4    e   25
7    h   55
8    i   60

In [18]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
7    False
8    False
dtype: bool

In [19]:
df.duplicated().sum()

0

In [20]:
df[df.duplicated()]

Empty DataFrame
Columns: [name, age]
Index: []

In [21]:
df.drop_duplicates()  ## there is no duplicates

  name  age
0    a   36
1    b   22
2    c   26
3    d   24
4    e   25
7    h   55
8    i   60

In [22]:
df['name']  = df['name'].apply(lambda x: x.upper())
df['name']

0    A
1    B
2    C
3    D
4    E
7    H
8    I
Name: name, dtype: object

In [23]:
df

  name  age
0    A   36
1    B   22
2    C   26
3    D   24
4    E   25
7    H   55
8    I   60

In [24]:
df.columns

Index(['name', 'age'], dtype='object')

In [25]:
df.index

Int64Index([0, 1, 2, 3, 4, 7, 8], dtype='int64')

In [26]:
df.reset_index()

   index name  age
0      0    A   36
1      1    B   22
2      2    C   26
3      3    D   24
4      4    E   25
5      7    H   55
6      8    I   60

In [27]:
df

  name  age
0    A   36
1    B   22
2    C   26
3    D   24
4    E   25
7    H   55
8    I   60

In [28]:
df.reset_index(inplace = True)

In [29]:
df

   index name  age
0      0    A   36
1      1    B   22
2      2    C   26
3      3    D   24
4      4    E   25
5      7    H   55
6      8    I   60

In [30]:
df.values

array([[0, 'A', 36],
       [1, 'B', 22],
       [2, 'C', 26],
       [3, 'D', 24],
       [4, 'E', 25],
       [7, 'H', 55],
       [8, 'I', 60]], dtype=object)

In [31]:
df.values[:,1]

array(['A', 'B', 'C', 'D', 'E', 'H', 'I'], dtype=object)

In [32]:
df.values[:,2]

array([36, 22, 26, 24, 25, 55, 60], dtype=object)

In [33]:
df['age']*2     ## df.age*2

0     72
1     44
2     52
3     48
4     50
5    110
6    120
Name: age, dtype: int64

## Slicing

In [34]:
df

   index name  age
0      0    A   36
1      1    B   22
2      2    C   26
3      3    D   24
4      4    E   25
5      7    H   55
6      8    I   60

In [35]:
df.loc[4]

index     4
name      E
age      25
Name: 4, dtype: object

In [36]:
df.loc[0,'name']

'A'

In [37]:
df.loc[3,'name']

'D'

In [38]:
df.iloc[0,1]

'A'

In [39]:
df.iloc[:,1]      ## df.loc[:,1] doesn't work

0    A
1    B
2    C
3    D
4    E
5    H
6    I
Name: name, dtype: object

In [40]:
df.loc[0:3, 'name']

0    A
1    B
2    C
3    D
Name: name, dtype: object

In [41]:
df.iloc[0:3, 1]

0    A
1    B
2    C
Name: name, dtype: object

In [42]:
df1

  name  age
0    a   36
1    b   22
2    c   26
3    d   24
4    e   25
5    f   26
6    g   50
7    h   55
8    i   60

In [43]:
df1[df1.age > 50]

  name  age
7    h   55
8    i   60

In [44]:
df1[df1.age %2 == 0]

  name  age
0    a   36
1    b   22
2    c   26
3    d   24
5    f   26
6    g   50
8    i   60

In [45]:
df1[(df1.age > 25) & (df1.age < 60)]

  name  age
0    a   36
2    c   26
5    f   26
6    g   50
7    h   55

In [46]:
df1[ ~ df1.age %2 == 0]

  name  age
4    e   25
7    h   55

In [47]:
df1.filter(items=['age',])

   age
0   36
1   22
2   26
3   24
4   25
5   26
6   50
7   55
8   60

In [48]:
df1.filter(like = 'ge')

   age
0   36
1   22
2   26
3   24
4   25
5   26
6   50
7   55
8   60

In [49]:
df1.filter(regex='^a')

   age
0   36
1   22
2   26
3   24
4   25
5   26
6   50
7   55
8   60

In [50]:
df1.name.apply(lambda name: name.startswith('a'))

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
Name: name, dtype: bool

In [51]:
df1.where(df1.age> 25)

  name   age
0    a  36.0
1  NaN   NaN
2    c  26.0
3  NaN   NaN
4  NaN   NaN
5    f  26.0
6    g  50.0
7    h  55.0
8    i  60.0

In [52]:
df1.where(df1.age> 25).dropna()  ## by defult row delete kore dropna(axix=1) dila columns delete hobe

  name   age
0    a  36.0
2    c  26.0
5    f  26.0
6    g  50.0
7    h  55.0
8    i  60.0

In [53]:
df1.where(df1.age> 25)[['age']].fillna(39)

    age
0  36.0
1  39.0
2  26.0
3  39.0
4  39.0
5  26.0
6  50.0
7  55.0
8  60.0

In [54]:
df1.where(df1.age> 25)[['age']].fillna(method='bfill')

    age
0  36.0
1  26.0
2  26.0
3  26.0
4  26.0
5  26.0
6  50.0
7  55.0
8  60.0

In [55]:
df1.where(df1.age> 25)[['age']].fillna(method='ffill')

    age
0  36.0
1  36.0
2  26.0
3  26.0
4  26.0
5  26.0
6  50.0
7  55.0
8  60.0

In [56]:
df = df.append(
  pd.DataFrame(
  {
      'index':[9,10],
      'name':['J','K'],
      'age':[32, 21]
  })
)
df

   index name  age
0      0    A   36
1      1    B   22
2      2    C   26
3      3    D   24
4      4    E   25
5      7    H   55
6      8    I   60
0      9    J   32
1     10    K   21

In [57]:
df['gender'] = ['M','F','M','F','M','F','M','F','M']

In [58]:
df

   index name  age gender
0      0    A   36      M
1      1    B   22      F
2      2    C   26      M
3      3    D   24      F
4      4    E   25      M
5      7    H   55      F
6      8    I   60      M
0      9    J   32      F
1     10    K   21      M